[
  {
    "title": "Defending SNAP",
    "hook": "SNAP feeds 41 million Americans—including children, seniors, and veterans—for about $160 per taxpayer per year. It works. Republicans just voted to gut it.",
    "key_facts": [
      "SNAP feeds 1 in 8 Americans: 22 million children, 5 million seniors, 1 million veterans.",
      "Reduces child poverty by 20%.",
      "Improves health and education outcomes.",
      "Every $1 in SNAP generates $1.50–$1.80 in local economic activity.",
      "SNAP costs $119B/year; Trump’s tax cuts for the wealthy cost $380B/year."
    ],
    "what_to_highlight": [
      "Republicans are slashing food assistance to fund tax breaks for the wealthy.",
      "Nearly 11 million people risk losing SNAP benefits.",
      "Benefits drop from $6.20 to $4.80 per day—families will go hungry.",
      "Fraud rate is under 1.5%; admin costs are among the lowest of any federal program.",
      "This isn’t about cutting waste—it’s about punishing working families."
    ],
    "suggested_post": "SNAP feeds kids, vets, and seniors. Republicans just voted to cut it—so billionaires can get another tax break. This isn’t austerity. It’s theft.",
    "sources": [
      "https://murmurmedia.substack.com/p/defending-snap",
      "https://www.cbpp.org/research/food-assistance/snap-helps-millions",
      "https://www.ers.usda.gov/topics/food-nutrition-assistance/supplemental-nutrition-assistance-program-snap/",
      "https://www.fns.usda.gov/snap/snap-data-tables"
    ]
  },
  {
    "title": "Republicans Cut Healthcare for 11 Million People",
    "hook": "Republicans’ proposed budget would cut Medicaid for up to 11 million people—gutting a program that saves lives, strengthens communities, and keeps hospitals open.",
    "key_facts": [
      "Medicaid provides healthcare for over 80 million Americans—including 40% of all children and 60% of nursing home residents.",
      "11 million people would lose coverage under the GOP’s proposed work requirements, including 1.7 million veterans and 4.3 million children.",
      "Cuts would disproportionately harm rural hospitals, which rely heavily on Medicaid reimbursements.",
      "States that implemented similar policies saw coverage losses without meaningful employment gains.",
      "The administrative cost of enforcing new requirements would cost more than the savings generated by kicking people off."
    ],
    "what_to_highlight": [
      "This is a direct attack on the most vulnerable—children, seniors, veterans, and people with disabilities.",
      "The GOP plan isn’t about saving money—it’s about shrinking government at the expense of public health.",
      "These cuts will hurt working families the most—especially in red states where Medicaid is essential.",
      "This is part of a long-standing pattern of targeting safety net programs to fund tax cuts for the wealthy."
    ],
    "suggested_post": "Republicans want to kick 11 million people off Medicaid—including kids, veterans, and seniors. All to fund tax breaks for billionaires. It’s cruel, it’s reckless, and it must be stopped.",
    "sources": [
      "https://www.murmurimpact.com/p/republicans-attack-medicaid",
      "https://www.murmurimpact.com/p/republicans-attack-medicaid-update",
      "https://www.murmurimpact.com/p/health-impact-of-the-big-beautiful",
      "https://www.cbpp.org/research/health/medicaid-work-requirements-could-cause-millions-to-lose-coverage",
      "https://www.kff.org/medicaid/issue-brief/10-things-to-know-about-medicaid/"
    ]
  },
  {
    "title": "Republicans' Reconciliation Bill",
    "hook": "The Republican Reconciliation Bill isn’t just a budget — it’s a political weapon targeting working families to pay for tax cuts for the wealthy.",
    "key_facts": [
      "The bill passed the House by a single vote and contains over 1,000 pages of sweeping reforms.",
      "It slashes funding for public education, housing assistance, and food security programs like SNAP.",
      "It delivers trillions in tax breaks, primarily benefiting corporations and the top 1%.",
      "It repeals climate investments and healthcare subsidies passed under the Inflation Reduction Act.",
      "The Congressional Budget Office (CBO) estimates it would increase inequality and reduce economic mobility."
    ],
    "what_to_highlight": [
      "This isn’t just about budgets — it’s about values.",
      "Point out who benefits (billionaires) and who suffers (working families).",
      "Emphasize the real-life impacts: rent hikes, school closures, food insecurity."
    ],
    "suggested_post": "The Republican “Reconciliation Bill” is a cruel con. It guts housing, education, and food aid – all to give billionaires another tax cut. We can’t let them get away with it.",
    "sources": [
      "https://www.whitehouse.gov/briefing-room/statements-releases/2025/05/22/statement-on-reconciliation-bill/",
      "https://www.cbo.gov/publication/59847",
      "https://www.cbpp.org/research/federal-budget/gop-budget-plan-analysis"
    ]
  },
  {
    "title": "Trump’s $1 Million Pardon",
    "hook": "Trump pardoned a tax cheat just days after his mom dropped $1M at Mar-a-Lago. No justice system should run on VIP access and yacht money. This isn’t leadership—it’s pay-to-play.",
    "key_facts": [
      "In April 2025, Paul Walczak, convicted of stealing $10 million in employee payroll taxes, was pardoned just 12 days after sentencing.",
      "His mother, GOP donor Elizabeth Fago, attended a $1 million-per-person fundraiser at Mar-a-Lago just weeks earlier, where attendees were promised face time with Trump.",
      "Walczak had already paid $8 million in restitution and admitted guilt—this was not a wrongful conviction.",
      "Ethics experts condemned the pardon as a possible abuse of power, raising concerns about transactional justice even though no direct quid pro quo has been proven.",
      "This fits a broader pattern: Trump’s pardons often benefit political allies, wealthy donors, or media figures aligned with his interests."
    ],
    "what_to_highlight": [
      "Wealthy individuals appear to have backdoor access to presidential pardons, undermining equal justice under the law.",
      "The Walczak case is not isolated—it reflects how power and privilege shield the well-connected.",
      "Even without a legal quid pro quo, the timing and access raise red flags for corruption and abuse of clemency."
    ],
    "suggested_post": "Trump pardoned a tax cheat just days after his mom dropped $1M at Mar-a-Lago. No justice system should run on VIP access and yacht money. This isn’t leadership—it’s pay-to-play.",
    "sources": [
      "https://www.moneycontrol.com/world/trump-pardons-donor-s-son-after-1-million-dinner-at-mar-a-lago-article-13052738.html",
      "https://www.the-independent.com/news/world/americas/us-politics/trump-pardon-paul-walczak-elizabeth-fago-b2758844.html",
      "https://newrepublic.com/post/195739/trump-pardon-tax-cheat-walzack-dinner-political-donor",
      "https://www.youtube.com/watch?v=G6lgL6WPyJE"
    ]
  },
  {
    "title": "DOGE Failed",
    "hook": "Elon Musk’s Department of Government Efficiency (DOGE) promised to cut waste and save taxpayers trillions. Instead, it failed to deliver real savings—while expanding surveillance, triggering chaos, and making government bigger and more dangerous.",
    "key_facts": [
      "Musk promised $2 trillion in savings. Verifiable savings? Just $5 billion—only 0.25% of what was promised.",
      "DOGE's most publicized cuts were mostly one-time actions like canceled leases, not structural reforms.",
      "While DOGE claimed $165 billion in savings, receipts exist for only $70 billion—most unverifiable.",
      "Independent watchdog *Musk Watch* estimates the real savings at just $5.02 billion.",
      "DOGE may ultimately cost taxpayers $135 billion due to lawsuits, inefficiencies, and lost tax revenue."
    ],
    "what_to_highlight": [
      "Despite the name, DOGE made the government less efficient and more chaotic.",
      "The agency caused mass layoffs at critical institutions—like the FAA and National Nuclear Security Administration—endangering lives.",
      "DOGE consolidated federal data into a centralized surveillance database spanning the IRS, DHS, and voter rolls.",
      "While claiming to fight waste, DOGE gutted tax enforcement—potentially losing the U.S. $2.4 trillion in future revenue."
    ],
    "suggested_post": "DOGE didn’t cut waste. It cut public health, nuclear security, and civil liberties. Elon Musk’s “efficiency” scam cost us jobs, safety, and trust—with almost no real savings.",
    "sources": [
      "https://murmurimpact.com",
      "https://www.cbsnews.com/news/doge-wall-of-receipts-shows-errors-tallying-billions-in-savings/",
      "https://www.reuters.com/world/us/doge-website-offers-error-filled-window-into-musks-government-overhaul-2025-03-04/",
      "https://www.businessinsider.com/larry-summers-doge-disastrous-failure-all-in-podcast-trump-administration-2025-4"
    ]
  },
  {
    "title": "Trump's Corruption: Crypto Profiteering",
    "hook": "Since returning to office, Donald Trump’s personal net worth has skyrocketed by over $6 billion—driven largely by his own crypto ventures and business dealings that profit from government influence. This isn’t public service. It’s self-enrichment.",
    "key_facts": [
      "Trump’s net worth has increased by more than $6 billion since January 2025, according to Forbes estimates and SEC filings.",
      "The $TRUMP memecoin launched just before his inauguration and surged to a $27 billion valuation—Trump-controlled entities hold an estimated 80% of the supply.",
      "The Trump family earned up to $100 million in trading fees in just the first two weeks of the token’s release.",
      "Trump Media announced plans to raise $2.5 billion for a Bitcoin fund—one that he controls—after signaling support for pro-crypto federal policies.",
      "Foreign investment from entities linked to China and the UAE has flowed into Trump-affiliated crypto projects, raising serious national security concerns."
    ],
    "what_to_highlight": [
      "Trump is using the presidency to boost his personal fortune—blurring the line between public power and private profit.",
      "His crypto empire has benefited from policy shifts he controls, creating a direct financial incentive for decisions made in office.",
      "The influx of foreign money into his ventures isn’t just corrupt—it’s dangerous."
    ],
    "suggested_post": "Trump is $6 billion richer since taking office. He’s using the presidency to push crypto coins he owns, raise billions for his businesses, and cash in on foreign investors. It’s corruption in real time—and we need to say it.",
    "sources": [
      "https://www.forbes.com/sites/chasewithorn/2025/05/28/donald-trump-net-worth/?sh=6f308fe86c4f",
      "https://en.wikipedia.org/wiki/%24Trump",
      "https://www.reuters.com/business/finance/how-trump-family-took-over-crypto-firm-it-raised-hundreds-millions-2025-03-31/",
      "https://www.aljazeera.com/economy/2025/5/27/trump-media-to-raise-2-5bn-to-invest-in-bitcoin",
      "https://www.theatlantic.com/ideas/archive/2025/05/trump-golden-age-corruption/682935/"
    ]
  },
  {
    "title": "Defending Social Security",
    "hook": "Social Security is the most successful government program in U.S. history—and it’s under attack. Donald Trump and Elon Musk are spreading lies to dismantle a system that keeps over 22 million Americans out of poverty. We can’t let them succeed.",
    "key_facts": [
      "Social Security lifts 22.7 million Americans out of poverty, including 16.1 million seniors.",
      "It provides 50% or more of total income for half of all U.S. seniors.",
      "4 million children and 9.2 million disabled workers rely on Social Security.",
      "It injects $1.2 trillion into the U.S. economy annually and reduces pressure on other safety net programs.",
      "Less than 1% of payments are improper—most are overpayments, not fraud, and the government actively recoups them.",
      "Social Security is not going bankrupt and does not add to the national debt."
    ],
    "what_to_highlight": [
      "Social Security is your money—an investment you’ve paid into with every paycheck.",
      "Lies about fraud, debt, and bankruptcy are designed to justify benefit cuts and privatization.",
      "The real threat is political: Trump and Musk want to dismantle Social Security under the guise of reform.",
      "The solution to future funding is simple: raise the cap on taxable income for high earners."
    ],
    "suggested_post": "Trump and Musk want to gut Social Security. Don’t fall for it. Social Security isn’t bankrupt or broken—it’s under attack. Raise the cap. Protect your money. Protect your future.",
    "sources": [
      "https://www.ssa.gov/news/press/factsheets/basicfact-alt.pdf",
      "https://www.cbpp.org/research/social-security/social-security-fact-sheet",
      "https://oig.ssa.gov",
      "https://cepr.net/issue-briefs/raise-the-cap-to-protect-social-security/",
      "https://www.npr.org/2020/08/10/900919029/what-trumps-payroll-tax-deferral-means-for-social-security"
    ],
    "image_url": "assets/social-security-post.png"
  }
]
